.. _vat_userguide:

VAT Strings
============

Introduction
------------

The function :func:`clean_gb_vat() <dataprep.clean.clean_gb_vat.clean_gb_vat>` cleans a column containing United Kingdom VAT number (VAT) strings, and standardizes them in a given format. The function :func:`validate_gb_vat() <dataprep.clean.clean_gb_vat.validate_gb_vat>` validates either a single VAT strings, a column of VAT strings or a DataFrame of VAT strings, returning `True` if the value is valid, and `False` otherwise.

VAT strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "980780684"
* `standard`: VAT strings with proper whitespace in the proper places, like "980 7806 84"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_gb_vat()` and `validate_gb_vat()`.

### An example dataset containing VAT strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "vat": [
            "980780684",
            "802311781",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              vat                                           address
0       980780684                                     123 Pine Ave.
1       802311781                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_gb_vat`

By default, `clean_gb_vat` will clean vat strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_gb_vat
clean_gb_vat(df, column = "vat")

,vat,address,vat_clean
0,980780684,123 Pine Ave.,980 7806 84
1,802311781,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_gb_vat(df, column = "vat", output_format="standard")

,vat,address,vat_clean
0,980780684,123 Pine Ave.,980 7806 84
1,802311781,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_gb_vat(df, column = "vat", output_format="compact")

              vat                                           address  vat_clean
0       980780684                                     123 Pine Ave.  980780684
1       802311781                                           main st        NaN
2     51824753556                      1234 west main heights 57033        NaN
3  51 824 753 556                    apt 1 789 s maple rd manhattan        NaN
4           hello                robie house, 789 north main street        NaN
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
6            NULL                                             hello        NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned VAT strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_gb_vat(df, column="vat", inplace=True)

     vat_clean                                           address
0  980 7806 84                                     123 Pine Ave.
1          NaN                                           main st
2          NaN                      1234 west main heights 57033
3          NaN                    apt 1 789 s maple rd manhattan
4          NaN                robie house, 789 north main street
5          NaN  (staples center) 1111 S Figueroa St, Los Angeles
6          NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_gb_vat(df, "vat", errors="coerce")

,vat,address,vat_clean
0,980780684,123 Pine Ave.,980 7806 84
1,802311781,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_gb_vat(df, "vat", errors="ignore")

,vat,address,vat_clean
0,980780684,123 Pine Ave.,980 7806 84
1,802311781,main st,802311781
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_gb_vat()`

`validate_gb_vat()` returns `True` when the input is a valid VAT. Otherwise it returns `False`.

The input of `validate_gb_vat()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_gb_vat()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_gb_vat()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_gb_vat
print(validate_gb_vat("980780684"))
print(validate_gb_vat("802311781"))
print(validate_gb_vat("51824753556"))
print(validate_gb_vat("51 824 753 556"))
print(validate_gb_vat("hello"))
print(validate_gb_vat(np.nan))
print(validate_gb_vat("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_gb_vat(df["vat"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: vat, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_gb_vat(df, column="vat")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: vat, dtype: bool

### Only DataFrame

In [11]:
validate_gb_vat(df)

     vat  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False